ARMmbed/mbed-os/targets/TARGET_Freescale/TARGET_MCUXpresso_MCUS/TARGET_KW41Z/drivers/fsl_dspi.c
    /* If the transfer count is zero, then return immediately.*/
    if (transfer->dataSize == 0) {
        return kStatus_InvalidArgument;
    }

    DSPI_StopTransfer(base);
    DSPI_DisableInterrupts(base, kDSPI_AllInterruptEnable);
    DSPI_FlushFifo(base, true, true);
    DSPI_ClearStatusFlags(base, kDSPI_AllStatusFlag);

    /*Calculate the command and lastCommand*/
    commandStruct.whichPcs =
        (dspi_which_pcs_t)(1U << ((transfer->configFlags & DSPI_MASTER_PCS_MASK) >> DSPI_MASTER_PCS_SHIFT));
    commandStruct.isEndOfQueue = false;
    commandStruct.clearTransferCount = false;
    commandStruct.whichCtar =
        (dspi_ctar_selection_t)((transfer->configFlags & DSPI_MASTER_CTAR_MASK) >> DSPI_MASTER_CTAR_SHIFT);
    commandStruct.isPcsContinuous = (bool)(transfer->configFlags & kDSPI_MasterPcsContinuous);

    command = DSPI_MasterGetFormattedCommand(&(commandStruct));

    commandStruct.isEndOfQueue = true;
    commandStruct.isPcsContinuous = (bool)(transfer->configFlags & kDSPI_MasterActiveAfterTransfer);
    lastCommand = DSPI_MasterGetFormattedCommand(&(commandStruct));

    /*Calculate the bitsPerFrame*/
    bitsPerFrame = ((base->CTAR[commandStruct.whichCtar] & SPI_CTAR_FMSZ_MASK) >> SPI_CTAR_FMSZ_SHIFT) + 1;

    txData = transfer->txData;
    rxData = transfer->rxData;
    remainingSendByteCount = transfer->dataSize;
    remainingReceiveByteCount = transfer->dataSize;

    if ((base->MCR & SPI_MCR_DIS_RXF_MASK) || (base->MCR & SPI_MCR_DIS_TXF_MASK)) {
        fifoSize = 1;
    } else {
        fifoSize = FSL_FEATURE_DSPI_FIFO_SIZEn(base);
    }

    DSPI_StartTransfer(base);

    if (bitsPerFrame <= 8) {
        while (remainingSendByteCount > 0) {
            if (remainingSendByteCount == 1) {
                while ((remainingReceiveByteCount - remainingSendByteCount) >= fifoSize) {
                    if (DSPI_GetStatusFlags(base) & kDSPI_RxFifoDrainRequestFlag) {
                        if (rxData != NULL) {
                            *(rxData) = DSPI_ReadData(base);
                            rxData++;
                        } else {
                            DSPI_ReadData(base);
                        }
                        remainingReceiveByteCount--;

                        DSPI_ClearStatusFlags(base, kDSPI_RxFifoDrainRequestFlag);
                    }
                }

                while (!(DSPI_GetStatusFlags(base) & kDSPI_TxFifoFillRequestFlag)) {
                    DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
                }

                if (txData != NULL) {
                    base->PUSHR = (*txData) | (lastCommand);
                    txData++;
                } else {
                    base->PUSHR = (lastCommand) | (dummyData);
                }
                DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
                remainingSendByteCount--;

                while (remainingReceiveByteCount > 0) {
                    if (DSPI_GetStatusFlags(base) & kDSPI_RxFifoDrainRequestFlag) {
                        if (rxData != NULL) {
                            /* Read data from POPR*/
                            *(rxData) = DSPI_ReadData(base);
                            rxData++;
                        } else {
                            DSPI_ReadData(base);
                        }
                        remainingReceiveByteCount--;

                        DSPI_ClearStatusFlags(base, kDSPI_RxFifoDrainRequestFlag);
                    }
                }
            } else {
                /*Wait until Tx Fifo is not full*/
                while (!(DSPI_GetStatusFlags(base) & kDSPI_TxFifoFillRequestFlag)) {
                    DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
                }
                if (txData != NULL) {
                    base->PUSHR = command | (uint16_t)(*txData);
                    txData++;
                } else {
                    base->PUSHR = command | dummyData;
                }
                remainingSendByteCount--;

                DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);

                if (DSPI_GetStatusFlags(base) & kDSPI_RxFifoDrainRequestFlag) {
                    if (rxData != NULL) {
                        *(rxData) = DSPI_ReadData(base);
                        rxData++;
                    } else {
                        DSPI_ReadData(base);
                    }
                    remainingReceiveByteCount--;

                    DSPI_ClearStatusFlags(base, kDSPI_RxFifoDrainRequestFlag);
                }
            }
        }
    } else {
        while (remainingSendByteCount > 0) {
            if (remainingSendByteCount <= 2) {
                while (((remainingReceiveByteCount - remainingSendByteCount) / 2) >= fifoSize) {
                    if (DSPI_GetStatusFlags(base) & kDSPI_RxFifoDrainRequestFlag) {
                        wordReceived = DSPI_ReadData(base);

                        if (rxData != NULL) {
                            *rxData = wordReceived;
                            ++rxData;
                            *rxData = wordReceived >> 8;
                            ++rxData;
                        }
                        remainingReceiveByteCount -= 2;

                        DSPI_ClearStatusFlags(base, kDSPI_RxFifoDrainRequestFlag);
                    }
                }

                while (!(DSPI_GetStatusFlags(base) & kDSPI_TxFifoFillRequestFlag)) {
                    DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
                }

                if (txData != NULL) {
                    wordToSend = *(txData);
                    ++txData;

                    if (remainingSendByteCount > 1) {
                        wordToSend |= (unsigned)(*(txData)) << 8U;
                        ++txData;
                    }
                } else {
                    wordToSend = dummyData;
                }

                base->PUSHR = lastCommand | wordToSend;

                DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
                remainingSendByteCount = 0;

                while (remainingReceiveByteCount > 0) {
                    if (DSPI_GetStatusFlags(base) & kDSPI_RxFifoDrainRequestFlag) {
                        wordReceived = DSPI_ReadData(base);

                        if (remainingReceiveByteCount != 1) {
                            if (rxData != NULL) {
                                *(rxData) = wordReceived;
                                ++rxData;
                                *(rxData) = wordReceived >> 8;
                                ++rxData;
                            }
                            remainingReceiveByteCount -= 2;
                        } else {
                            if (rxData != NULL) {
                                *(rxData) = wordReceived;
                                ++rxData;
                            }
                            remainingReceiveByteCount--;
                        }
                        DSPI_ClearStatusFlags(base, kDSPI_RxFifoDrainRequestFlag);
                    }
                }
            } else {
                /*Wait until Tx Fifo is not full*/
                while (!(DSPI_GetStatusFlags(base) & kDSPI_TxFifoFillRequestFlag)) {
                    DSPI_ClearStatusFlags(base, kDSPI_TxFifoFillRequestFlag);
                }

                if (txData != NULL) {
                    wordToSend = *(txData);
                    ++txData;
                    wordToSend |= (unsigned)(*(txData)) << 8U;
                    ++txData;
                } else {
                    wordToSend = dummyData;
                }
                base->PUSHR = command | wordToSend;
                remainingSendByteCount -= 2;

